clc;
clear;
x=ones(6,1);
load Z;
A=ones(6,6);
b=[10000,10000,10000,10000,10000,10000]';
lb=[2.45871559600000;3.41951219500000;4.40000000000000;3;3.12992126000000;3.58245614000000];
ub=[inf,inf,inf,inf,inf,inf];
%ub=[10.8096774200000;19.8000000000000;29.9000000000000;17.6117647100000;31.9814925400000;19.6706140400000];
%Z:第一到六列为花叶、花菜、水生根茎、茄、辣椒、食用菌

x0=0;%设置初始值
%设置全局变量天数d
global d
for d=1:7
    [x(1,d),fval(1,d)]=fmincon(@fun1,x0,[],[],[],[],lb(1),ub(1));
    [x(2,d),fval(2,d)]=fmincon(@fun2,x0,[],[],[],[],lb(2),ub(2));
    [x(3,d),fval(3,d)]=fmincon(@fun3,x0,[],[],[],[],lb(3),ub(3));
    [x(4,d),fval(4,d)]=fmincon(@fun4,x0,[],[],[],[],lb(4),ub(4));
    [x(5,d),fval(5,d)]=fmincon(@fun5,x0,[],[],[],[],lb(5),ub(5));
    [x(6,d),fval(6,d)]=fmincon(@fun6,x0,[],[],[],[],lb(6),ub(6));
end
fval=-fval;